AlmAck/svdtonuttx/demo/h/da1470_i3c.h
/****************************************************************************
 * ./tmp/da1470_i3c.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470_I3C_H
#define __DA1470_I3C_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470_I3C_I3C_BUS_FREE_AVAIL_TIMING_OFFSET    0x00D4 /* Bus Free Timing Register */
#define DA1470_I3C_I3C_COMMAND_QUEUE_PORT_OFFSET       0x000C /* COMMAND_QUEUE_PORT */
#define DA1470_I3C_I3C_DATA_BUFFER_STAT_LEVEL_OFFSET   0x0050 /* Data Buffer Status Level Register */
#define DA1470_I3C_I3C_DATA_BUFFER_THLD_CTRL_OFFSET    0x0020 /* Data Buffer Threshold Control Register */
#define DA1470_I3C_I3C_DEVICE_ADDR_OFFSET              0x0004 /* Device Address Register */
#define DA1470_I3C_I3C_DEVICE_ADDR_TABLE_PTR_OFFSET    0x005C /* Pointer for Device Address Table Registers */
#define DA1470_I3C_I3C_DEVICE_CTRL_EXTENDED_OFFSET     0x00B0 /* Device Control Extended Register */
#define DA1470_I3C_I3C_DEVICE_CTRL_OFFSET              0x0000 /* Device Control Register */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC1_OFFSET      0x0280 /* Device Address Table of Device1 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC2_OFFSET      0x0284 /* Device Address Table of Device2 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC3_OFFSET      0x0288 /* Device Address Table of Device3 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC4_OFFSET      0x028C /* Device Address Table of Device4 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC5_OFFSET      0x0290 /* Device Address Table of Device5 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC6_OFFSET      0x0294 /* Device Address Table of Device6 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC7_OFFSET      0x0298 /* Device Address Table of Device7 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC8_OFFSET      0x029C /* Device Address Table of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC1_OFFSET     0x0200 /* Device Characteristic Table Location-1 of Device1 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC2_OFFSET     0x0204 /* Device Characteristic Table Location-2 of Device1 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC3_OFFSET     0x0208 /* Device Characteristic Table Location-3 of Device1 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC4_OFFSET     0x020C /* Device Characteristic Table Location-4 of Device1 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC1_OFFSET     0x0210 /* Device Characteristic Table Location-1 of Device2 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC2_OFFSET     0x0214 /* Device Characteristic Table Location-2 of Device2 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC3_OFFSET     0x0218 /* Device Characteristic Table Location-3 of Device2 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC4_OFFSET     0x021C /* Device Characteristic Table Location-4 of Device2 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC1_OFFSET     0x0220 /* Device Characteristic Table Location-1 of Device3 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC2_OFFSET     0x0224 /* Device Characteristic Table Location-2 of Device3 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC3_OFFSET     0x0228 /* Device Characteristic Table Location-3 of Device3 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC4_OFFSET     0x022C /* Device Characteristic Table Location-4 of Device3 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC1_OFFSET     0x0230 /* Device Characteristic Table Location-1 of Device4 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC2_OFFSET     0x0234 /* Device Characteristic Table Location-2 of Device4 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC3_OFFSET     0x0238 /* Device Characteristic Table Location-3 of Device4 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC4_OFFSET     0x023C /* Device Characteristic Table Location-4 of Device4 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC1_OFFSET     0x0240 /* Device Characteristic Table Location-1 of Device5 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC2_OFFSET     0x0244 /* Device Characteristic Table Location-2 of Device5 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC3_OFFSET     0x0248 /* Device Characteristic Table Location-3 of Device5 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC4_OFFSET     0x024C /* Device Characteristic Table Location-4 of Device5 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC1_OFFSET     0x0250 /* Device Characteristic Table Location-1 of Device6 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC2_OFFSET     0x0254 /* Device Characteristic Table Location-2 of Device6 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC3_OFFSET     0x0258 /* Device Characteristic Table Location-3 of Device6 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC4_OFFSET     0x025C /* Device Characteristic Table Location-4 of Device6 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC1_OFFSET     0x0260 /* Device Characteristic Table Location-1 of Device7 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC2_OFFSET     0x0264 /* Device Characteristic Table Location-2 of Device7 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC3_OFFSET     0x0268 /* Device Characteristic Table Location-3 of Device7 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC4_OFFSET     0x026C /* Device Characteristic Table Location-4 of Device7 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC1_OFFSET     0x0270 /* Device Characteristic Table Location-1 of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC2_OFFSET     0x0274 /* Device Characteristic Table Location-2 of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC3_OFFSET     0x0278 /* Device Characteristic Table Location-3 of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC4_OFFSET     0x027C /* Device Characteristic Table Location-4 of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE_POINTER_OFFSET   0x0060 /* Pointer for Device Characteristics Table */
#define DA1470_I3C_I3C_HW_CAPABILITY_OFFSET            0x0008 /* Hardware Capability register */
#define DA1470_I3C_I3C_IBI_QUEUE_CTRL_OFFSET           0x0024 /* IBI Queue Control Register */
#define DA1470_I3C_I3C_IBI_QUEUE_STATUS_DATA_OFFSET    0x0018 /* In-Band Interrupt Queue Status and Data Register */
#define DA1470_I3C_I3C_IBI_SIR_REQ_REJECT_OFFSET       0x0030 /* IBI SIR Request Rejection Control Register */
#define DA1470_I3C_I3C_INTR_FORCE_OFFSET               0x0048 /* Interrupt Force Enable Register */
#define DA1470_I3C_I3C_INTR_SIGNAL_EN_OFFSET           0x0044 /* Interrupt Signal Enable Register */
#define DA1470_I3C_I3C_INTR_STATUS_EN_OFFSET           0x0040 /* Interrupt Status Enable Register */
#define DA1470_I3C_I3C_INTR_STATUS_OFFSET              0x003C /* Interrupt Status Register */
#define DA1470_I3C_I3C_PRESENT_STATE_OFFSET            0x0054 /* Present State Register */
#define DA1470_I3C_I3C_QUEUE_SIZE_CAPABILITY_OFFSET    0x00E8 /* DWC_mipi_i3c Queue Size Capability Register */
#define DA1470_I3C_I3C_QUEUE_STATUS_LEVEL_OFFSET       0x004C /* Queue Status Level Register */
#define DA1470_I3C_I3C_QUEUE_THLD_CTRL_OFFSET          0x001C /* Queue Threshold Control Register */
#define DA1470_I3C_I3C_RESET_CTRL_OFFSET               0x0034 /* Reset Control Register */
#define DA1470_I3C_I3C_RESPONSE_QUEUE_PORT_OFFSET      0x0010 /* RESPONSE_QUEUE_PORT */
#define DA1470_I3C_I3C_RX_TX_DATA_PORT_OFFSET          0x0014 /* Receive and Transmit Data Port Register */
#define DA1470_I3C_I3C_SCL_EXT_LCNT_TIMING_OFFSET      0x00C8 /* SCL Extended Low Count Timing Register */
#define DA1470_I3C_I3C_SCL_EXT_TERMN_LCNT_TIME_OFFSET  0x00CC /* SCL Termination Bit Low count Timing Register */
#define DA1470_I3C_I3C_SCL_I2C_FMP_TIMING_OFFSET       0x00C0 /* SCL I2C Fast Mode Plus Timing Register */
#define DA1470_I3C_I3C_SCL_I2C_FM_TIMING_OFFSET        0x00BC /* SCL I2C Fast Mode Timing Register */
#define DA1470_I3C_I3C_SCL_I3C_OD_TIMING_OFFSET        0x00B4 /* SCL I3C Open Drain Timing Register */
#define DA1470_I3C_I3C_SCL_I3C_PP_TIMING_OFFSET        0x00B8 /* SCL I3C Push Pull Timing Register */
#define DA1470_I3C_I3C_SDA_HOLD_DLY_TIMING_OFFSET      0x00D0 /* SDA Hold Delay Timing Register */
#define DA1470_I3C_I3C_SLV_EVENT_STATUS_OFFSET         0x0038 /* Slave Event Status Register */
#define DA1470_I3C_I3C_VENDOR_SPECIFIC_PTR_OFFSET      0x006C /* Pointer for Vendor specific Registers */
#define DA1470_I3C_I3C_VER_ID_OFFSET                   0x00E0 /* DWC_mipi_i3c Version ID Register */
#define DA1470_I3C_I3C_VER_TYPE_OFFSET                 0x00E4 /* DWC_mipi_i3c Version Type Register */

