AlmAck/svdtonuttx/demo/h/da1470_i3c.h
/* Register addresses *******************************************************/

#define DA1470_I3C_BASE                                0x50020C00 /* I3C registers */

#define DA1470_I3C_I3C_BUS_FREE_AVAIL_TIMING           (DA1470_I3C_BASE + DA1470_I3C_I3C_BUS_FREE_AVAIL_TIMING_OFFSET) /* Bus Free Timing Register */
#define DA1470_I3C_I3C_COMMAND_QUEUE_PORT              (DA1470_I3C_BASE + DA1470_I3C_I3C_COMMAND_QUEUE_PORT_OFFSET) /* COMMAND_QUEUE_PORT */
#define DA1470_I3C_I3C_DATA_BUFFER_STAT_LEVEL          (DA1470_I3C_BASE + DA1470_I3C_I3C_DATA_BUFFER_STAT_LEVEL_OFFSET) /* Data Buffer Status Level Register */
#define DA1470_I3C_I3C_DATA_BUFFER_THLD_CTRL           (DA1470_I3C_BASE + DA1470_I3C_I3C_DATA_BUFFER_THLD_CTRL_OFFSET) /* Data Buffer Threshold Control Register */
#define DA1470_I3C_I3C_DEVICE_ADDR                     (DA1470_I3C_BASE + DA1470_I3C_I3C_DEVICE_ADDR_OFFSET) /* Device Address Register */
#define DA1470_I3C_I3C_DEVICE_ADDR_TABLE_PTR           (DA1470_I3C_BASE + DA1470_I3C_I3C_DEVICE_ADDR_TABLE_PTR_OFFSET) /* Pointer for Device Address Table Registers */
#define DA1470_I3C_I3C_DEVICE_CTRL_EXTENDED            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEVICE_CTRL_EXTENDED_OFFSET) /* Device Control Extended Register */
#define DA1470_I3C_I3C_DEVICE_CTRL                     (DA1470_I3C_BASE + DA1470_I3C_I3C_DEVICE_CTRL_OFFSET) /* Device Control Register */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC1             (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC1_OFFSET) /* Device Address Table of Device1 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC2             (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC2_OFFSET) /* Device Address Table of Device2 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC3             (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC3_OFFSET) /* Device Address Table of Device3 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC4             (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC4_OFFSET) /* Device Address Table of Device4 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC5             (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC5_OFFSET) /* Device Address Table of Device5 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC6             (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC6_OFFSET) /* Device Address Table of Device6 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC7             (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC7_OFFSET) /* Device Address Table of Device7 */
#define DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC8             (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_ADDR_TABLE_LOC8_OFFSET) /* Device Address Table of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC1            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC1_OFFSET) /* Device Characteristic Table Location-1 of Device1 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC2            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC2_OFFSET) /* Device Characteristic Table Location-2 of Device1 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC3            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC3_OFFSET) /* Device Characteristic Table Location-3 of Device1 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC4            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE1_LOC4_OFFSET) /* Device Characteristic Table Location-4 of Device1 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC1            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC1_OFFSET) /* Device Characteristic Table Location-1 of Device2 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC2            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC2_OFFSET) /* Device Characteristic Table Location-2 of Device2 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC3            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC3_OFFSET) /* Device Characteristic Table Location-3 of Device2 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC4            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE2_LOC4_OFFSET) /* Device Characteristic Table Location-4 of Device2 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC1            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC1_OFFSET) /* Device Characteristic Table Location-1 of Device3 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC2            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC2_OFFSET) /* Device Characteristic Table Location-2 of Device3 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC3            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC3_OFFSET) /* Device Characteristic Table Location-3 of Device3 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC4            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE3_LOC4_OFFSET) /* Device Characteristic Table Location-4 of Device3 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC1            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC1_OFFSET) /* Device Characteristic Table Location-1 of Device4 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC2            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC2_OFFSET) /* Device Characteristic Table Location-2 of Device4 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC3            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC3_OFFSET) /* Device Characteristic Table Location-3 of Device4 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC4            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE4_LOC4_OFFSET) /* Device Characteristic Table Location-4 of Device4 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC1            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC1_OFFSET) /* Device Characteristic Table Location-1 of Device5 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC2            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC2_OFFSET) /* Device Characteristic Table Location-2 of Device5 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC3            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC3_OFFSET) /* Device Characteristic Table Location-3 of Device5 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC4            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE5_LOC4_OFFSET) /* Device Characteristic Table Location-4 of Device5 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC1            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC1_OFFSET) /* Device Characteristic Table Location-1 of Device6 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC2            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC2_OFFSET) /* Device Characteristic Table Location-2 of Device6 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC3            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC3_OFFSET) /* Device Characteristic Table Location-3 of Device6 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC4            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE6_LOC4_OFFSET) /* Device Characteristic Table Location-4 of Device6 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC1            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC1_OFFSET) /* Device Characteristic Table Location-1 of Device7 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC2            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC2_OFFSET) /* Device Characteristic Table Location-2 of Device7 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC3            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC3_OFFSET) /* Device Characteristic Table Location-3 of Device7 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC4            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE7_LOC4_OFFSET) /* Device Characteristic Table Location-4 of Device7 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC1            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC1_OFFSET) /* Device Characteristic Table Location-1 of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC2            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC2_OFFSET) /* Device Characteristic Table Location-2 of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC3            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC3_OFFSET) /* Device Characteristic Table Location-3 of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC4            (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE8_LOC4_OFFSET) /* Device Characteristic Table Location-4 of Device8 */
#define DA1470_I3C_I3C_DEV_CHAR_TABLE_POINTER          (DA1470_I3C_BASE + DA1470_I3C_I3C_DEV_CHAR_TABLE_POINTER_OFFSET) /* Pointer for Device Characteristics Table */
#define DA1470_I3C_I3C_HW_CAPABILITY                   (DA1470_I3C_BASE + DA1470_I3C_I3C_HW_CAPABILITY_OFFSET) /* Hardware Capability register */
#define DA1470_I3C_I3C_IBI_QUEUE_CTRL                  (DA1470_I3C_BASE + DA1470_I3C_I3C_IBI_QUEUE_CTRL_OFFSET) /* IBI Queue Control Register */
#define DA1470_I3C_I3C_IBI_QUEUE_STATUS_DATA           (DA1470_I3C_BASE + DA1470_I3C_I3C_IBI_QUEUE_STATUS_DATA_OFFSET) /* In-Band Interrupt Queue Status and Data Register */
#define DA1470_I3C_I3C_IBI_SIR_REQ_REJECT              (DA1470_I3C_BASE + DA1470_I3C_I3C_IBI_SIR_REQ_REJECT_OFFSET) /* IBI SIR Request Rejection Control Register */
#define DA1470_I3C_I3C_INTR_FORCE                      (DA1470_I3C_BASE + DA1470_I3C_I3C_INTR_FORCE_OFFSET) /* Interrupt Force Enable Register */
#define DA1470_I3C_I3C_INTR_SIGNAL_EN                  (DA1470_I3C_BASE + DA1470_I3C_I3C_INTR_SIGNAL_EN_OFFSET) /* Interrupt Signal Enable Register */
#define DA1470_I3C_I3C_INTR_STATUS_EN                  (DA1470_I3C_BASE + DA1470_I3C_I3C_INTR_STATUS_EN_OFFSET) /* Interrupt Status Enable Register */
#define DA1470_I3C_I3C_INTR_STATUS                     (DA1470_I3C_BASE + DA1470_I3C_I3C_INTR_STATUS_OFFSET) /* Interrupt Status Register */
#define DA1470_I3C_I3C_PRESENT_STATE                   (DA1470_I3C_BASE + DA1470_I3C_I3C_PRESENT_STATE_OFFSET) /* Present State Register */
#define DA1470_I3C_I3C_QUEUE_SIZE_CAPABILITY           (DA1470_I3C_BASE + DA1470_I3C_I3C_QUEUE_SIZE_CAPABILITY_OFFSET) /* DWC_mipi_i3c Queue Size Capability Register */
#define DA1470_I3C_I3C_QUEUE_STATUS_LEVEL              (DA1470_I3C_BASE + DA1470_I3C_I3C_QUEUE_STATUS_LEVEL_OFFSET) /* Queue Status Level Register */
#define DA1470_I3C_I3C_QUEUE_THLD_CTRL                 (DA1470_I3C_BASE + DA1470_I3C_I3C_QUEUE_THLD_CTRL_OFFSET) /* Queue Threshold Control Register */
#define DA1470_I3C_I3C_RESET_CTRL                      (DA1470_I3C_BASE + DA1470_I3C_I3C_RESET_CTRL_OFFSET) /* Reset Control Register */
#define DA1470_I3C_I3C_RESPONSE_QUEUE_PORT             (DA1470_I3C_BASE + DA1470_I3C_I3C_RESPONSE_QUEUE_PORT_OFFSET) /* RESPONSE_QUEUE_PORT */
#define DA1470_I3C_I3C_RX_TX_DATA_PORT                 (DA1470_I3C_BASE + DA1470_I3C_I3C_RX_TX_DATA_PORT_OFFSET) /* Receive and Transmit Data Port Register */
#define DA1470_I3C_I3C_SCL_EXT_LCNT_TIMING             (DA1470_I3C_BASE + DA1470_I3C_I3C_SCL_EXT_LCNT_TIMING_OFFSET) /* SCL Extended Low Count Timing Register */
#define DA1470_I3C_I3C_SCL_EXT_TERMN_LCNT_TIME         (DA1470_I3C_BASE + DA1470_I3C_I3C_SCL_EXT_TERMN_LCNT_TIME_OFFSET) /* SCL Termination Bit Low count Timing Register */
#define DA1470_I3C_I3C_SCL_I2C_FMP_TIMING              (DA1470_I3C_BASE + DA1470_I3C_I3C_SCL_I2C_FMP_TIMING_OFFSET) /* SCL I2C Fast Mode Plus Timing Register */
#define DA1470_I3C_I3C_SCL_I2C_FM_TIMING               (DA1470_I3C_BASE + DA1470_I3C_I3C_SCL_I2C_FM_TIMING_OFFSET) /* SCL I2C Fast Mode Timing Register */
#define DA1470_I3C_I3C_SCL_I3C_OD_TIMING               (DA1470_I3C_BASE + DA1470_I3C_I3C_SCL_I3C_OD_TIMING_OFFSET) /* SCL I3C Open Drain Timing Register */
#define DA1470_I3C_I3C_SCL_I3C_PP_TIMING               (DA1470_I3C_BASE + DA1470_I3C_I3C_SCL_I3C_PP_TIMING_OFFSET) /* SCL I3C Push Pull Timing Register */
#define DA1470_I3C_I3C_SDA_HOLD_DLY_TIMING             (DA1470_I3C_BASE + DA1470_I3C_I3C_SDA_HOLD_DLY_TIMING_OFFSET) /* SDA Hold Delay Timing Register */
#define DA1470_I3C_I3C_SLV_EVENT_STATUS                (DA1470_I3C_BASE + DA1470_I3C_I3C_SLV_EVENT_STATUS_OFFSET) /* Slave Event Status Register */
#define DA1470_I3C_I3C_VENDOR_SPECIFIC_PTR             (DA1470_I3C_BASE + DA1470_I3C_I3C_VENDOR_SPECIFIC_PTR_OFFSET) /* Pointer for Vendor specific Registers */
#define DA1470_I3C_I3C_VER_ID                          (DA1470_I3C_BASE + DA1470_I3C_I3C_VER_ID_OFFSET) /* DWC_mipi_i3c Version ID Register */
#define DA1470_I3C_I3C_VER_TYPE                        (DA1470_I3C_BASE + DA1470_I3C_I3C_VER_TYPE_OFFSET) /* DWC_mipi_i3c Version Type Register */

/* Register bit definitions *************************************************/


/* I3C_BUS_FREE_AVAIL_TIMING Register */

#define BUS_FREE_TIME_MASK                             (0xFFFF << 0) /* This register field is used only in Master mode of operation  I3C Bus Free Count */
#define BUS_FREE_TIME_POS                              (0) /* This register field is used only in Master mode of operation  I3C Bus Free Count */

/* I3C_COMMAND_QUEUE_PORT Register */

