AlmAck/svdtonuttx/demo/h/da1470_i3c.h
#define COMMAND_MASK                                   (0xFFFFFFFF << 0) /* 32 bit command */
#define COMMAND_POS                                    (0) /* 32 bit command */

/* I3C_DATA_BUFFER_STAT_LEVEL Register */

#define RX_BUF_BLR_MASK                                (0xFF << 16) /* Receive Buffer Level Value.  Contains the number of valid data entries in the re */
#define RX_BUF_BLR_POS                                 (16) /* Receive Buffer Level Value.  Contains the number of valid data entries in the re */
#define TX_BUF_EMPTY_LOC_MASK                          (0xFF << 0) /* Transmit Buffer Empty Level Value.  Contains the number of empty locations in th */
#define TX_BUF_EMPTY_LOC_POS                           (0) /* Transmit Buffer Empty Level Value.  Contains the number of empty locations in th */

/* I3C_DATA_BUFFER_THLD_CTRL Register */

#define RX_START_THLD_MASK                             (0x7 << 24) /* Receive Start Threshold Value.  In master mode of operation when the controller  */
#define RX_START_THLD_POS                              (24) /* Receive Start Threshold Value.  In master mode of operation when the controller  */
#define TX_START_THLD_MASK                             (0x7 << 16) /* Transfer Start Threshold Value.  In master mode of operation when the controller */
#define TX_START_THLD_POS                              (16) /* Transfer Start Threshold Value.  In master mode of operation when the controller */
#define RX_BUF_THLD_MASK                               (0x7 << 8) /* Receive Buffer Threshold Value.  This field controls the number of entries (or a */
#define RX_BUF_THLD_POS                                (8) /* Receive Buffer Threshold Value.  This field controls the number of entries (or a */
#define TX_EMPTY_BUF_THLD_MASK                         (0x7 << 0) /* Transmit Buffer Threshold Value.  This field controls the number of empty locati */
#define TX_EMPTY_BUF_THLD_POS                          (0) /* Transmit Buffer Threshold Value.  This field controls the number of empty locati */

/* I3C_DEVICE_ADDR Register */

#define DYNAMIC_ADDR_VALID                             (1U << 31) /* Dynamic Address Valid  This bit is used to control whether the DYNAMIC_ADDR is v */
#define DYNAMIC_ADDR_MASK                              (0x7F << 16) /* Device Dynamic Address.  This field is used to program the Device Dynamic Addres */
#define DYNAMIC_ADDR_POS                               (16) /* Device Dynamic Address.  This field is used to program the Device Dynamic Addres */

/* I3C_DEVICE_ADDR_TABLE_PTR Register */

#define DEV_ADDR_TABLE_DEPTH_MASK                      (0xFFFF << 16) /* Depth of Device Address Table */
#define DEV_ADDR_TABLE_DEPTH_POS                       (16) /* Depth of Device Address Table */
#define P_DEV_ADDR_TABLE_START_ADDR_MASK               (0xFFFF << 0) /* Start Address of Device Address Table. */
#define P_DEV_ADDR_TABLE_START_ADDR_POS                (0) /* Start Address of Device Address Table. */

/* I3C_DEVICE_CTRL_EXTENDED Register */

#define DEV_OPERATION_MODE_MASK                        (0x3 << 0) /* This bit is used to select the Device Operation Mode before the controller is en */
#define DEV_OPERATION_MODE_POS                         (0) /* This bit is used to select the Device Operation Mode before the controller is en */

/* I3C_DEVICE_CTRL Register */

#define ENABLE                                         (1U << 31) /* Controls whether or not DWC_mipi_i3c is enabled.  1: Enables the DWC_mipi_i3c co */
#define RESUME                                         (1U << 30) /* DWC_mipi_i3c Resume.  This bit is used to resume the Controller after it goes to */
#define ABORT                                          (1U << 29) /* DWC_mipi_i3c Abort.  This bit is used in master mode of operation.  This bit all */
#define DMA_ENABLE_I3C                                 (1U << 28) /* DMA Handshake Interface Enable.  This bit is used to enable or disable the DMA H */
#define HOT_JOIN_CTRL                                  (1U << 8) /* Hot-Join Ack/Nack Control  This bit is used in master mode of operation.  This b */
#define I2C_SLAVE_PRESENT                              (1U << 7) /* I2C Slave Present  This bit is used in master mode of operation.  This Bit indic */
#define IBA_INCLUDE                                    (1U << 0) /* I3C Broadcast Address include.  This bit is used in master mode of operation.  T */

/* I3C_DEV_ADDR_TABLE_LOC1 Register */

#define LEGACY_I2C_DEVICE                              (1U << 31) /* Legacy I2C device or not.  This bit should be set to 1 if the device is a legacy */
#define DEV_NACK_RETRY_CNT_MASK                        (0x3 << 29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_NACK_RETRY_CNT_POS                         (29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_DYNAMIC_ADDR_MASK                          (0xFF << 16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_DYNAMIC_ADDR_POS                           (16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_STATIC_ADDR_MASK                           (0x7F << 0) /* Device Static Address. */
#define DEV_STATIC_ADDR_POS                            (0) /* Device Static Address. */

/* I3C_DEV_ADDR_TABLE_LOC2 Register */

#define LEGACY_I2C_DEVICE                              (1U << 31) /* Legacy I2C device or not.  This bit should be set to 1 if the device is a legacy */
#define DEV_NACK_RETRY_CNT_MASK                        (0x3 << 29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_NACK_RETRY_CNT_POS                         (29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_DYNAMIC_ADDR_MASK                          (0xFF << 16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_DYNAMIC_ADDR_POS                           (16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_STATIC_ADDR_MASK                           (0x7F << 0) /* Device Static Address. */
#define DEV_STATIC_ADDR_POS                            (0) /* Device Static Address. */

/* I3C_DEV_ADDR_TABLE_LOC3 Register */

#define LEGACY_I2C_DEVICE                              (1U << 31) /* Legacy I2C device or not.  This bit should be set to 1 if the device is a legacy */
#define DEV_NACK_RETRY_CNT_MASK                        (0x3 << 29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_NACK_RETRY_CNT_POS                         (29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_DYNAMIC_ADDR_MASK                          (0xFF << 16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_DYNAMIC_ADDR_POS                           (16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_STATIC_ADDR_MASK                           (0x7F << 0) /* Device Static Address. */
#define DEV_STATIC_ADDR_POS                            (0) /* Device Static Address. */

/* I3C_DEV_ADDR_TABLE_LOC4 Register */

#define LEGACY_I2C_DEVICE                              (1U << 31) /* Legacy I2C device or not.  This bit should be set to 1 if the device is a legacy */
#define DEV_NACK_RETRY_CNT_MASK                        (0x3 << 29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_NACK_RETRY_CNT_POS                         (29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_DYNAMIC_ADDR_MASK                          (0xFF << 16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_DYNAMIC_ADDR_POS                           (16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_STATIC_ADDR_MASK                           (0x7F << 0) /* Device Static Address. */
#define DEV_STATIC_ADDR_POS                            (0) /* Device Static Address. */

/* I3C_DEV_ADDR_TABLE_LOC5 Register */

#define LEGACY_I2C_DEVICE                              (1U << 31) /* Legacy I2C device or not.  This bit should be set to 1 if the device is a legacy */
#define DEV_NACK_RETRY_CNT_MASK                        (0x3 << 29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_NACK_RETRY_CNT_POS                         (29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_DYNAMIC_ADDR_MASK                          (0xFF << 16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_DYNAMIC_ADDR_POS                           (16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_STATIC_ADDR_MASK                           (0x7F << 0) /* Device Static Address. */
#define DEV_STATIC_ADDR_POS                            (0) /* Device Static Address. */

