AlmAck/svdtonuttx/demo/h/da1470_i3c.h
/* I3C_DEV_ADDR_TABLE_LOC6 Register */

#define LEGACY_I2C_DEVICE                              (1U << 31) /* Legacy I2C device or not.  This bit should be set to 1 if the device is a legacy */
#define DEV_NACK_RETRY_CNT_MASK                        (0x3 << 29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_NACK_RETRY_CNT_POS                         (29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_DYNAMIC_ADDR_MASK                          (0xFF << 16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_DYNAMIC_ADDR_POS                           (16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_STATIC_ADDR_MASK                           (0x7F << 0) /* Device Static Address. */
#define DEV_STATIC_ADDR_POS                            (0) /* Device Static Address. */

/* I3C_DEV_ADDR_TABLE_LOC7 Register */

#define LEGACY_I2C_DEVICE                              (1U << 31) /* Legacy I2C device or not.  This bit should be set to 1 if the device is a legacy */
#define DEV_NACK_RETRY_CNT_MASK                        (0x3 << 29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_NACK_RETRY_CNT_POS                         (29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_DYNAMIC_ADDR_MASK                          (0xFF << 16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_DYNAMIC_ADDR_POS                           (16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_STATIC_ADDR_MASK                           (0x7F << 0) /* Device Static Address. */
#define DEV_STATIC_ADDR_POS                            (0) /* Device Static Address. */

/* I3C_DEV_ADDR_TABLE_LOC8 Register */

#define LEGACY_I2C_DEVICE                              (1U << 31) /* Legacy I2C device or not.  This bit should be set to 1 if the device is a legacy */
#define DEV_NACK_RETRY_CNT_MASK                        (0x3 << 29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_NACK_RETRY_CNT_POS                         (29) /* This field is used to set the Device NACK Retry count for the particular device. */
#define DEV_DYNAMIC_ADDR_MASK                          (0xFF << 16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_DYNAMIC_ADDR_POS                           (16) /* Device Dynamic Address with parity. The MSB, bit[23], should be programmed with  */
#define DEV_STATIC_ADDR_MASK                           (0x7F << 0) /* Device Static Address. */
#define DEV_STATIC_ADDR_POS                            (0) /* Device Static Address. */

/* I3C_DEV_CHAR_TABLE1_LOC1 Register */

#define LSB_PROVISIONAL_ID_MASK                        (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define LSB_PROVISIONAL_ID_POS                         (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE1_LOC2 Register */

#define MSB_PROVISIONAL_ID_MASK                        (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define MSB_PROVISIONAL_ID_POS                         (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE1_LOC3 Register */

#define BCR_MASK                                       (0xFF << 8) /* Bus Characteristic Value */
#define BCR_POS                                        (8) /* Bus Characteristic Value */
#define DCR_MASK                                       (0xFF << 0) /* Device Characteristic Value */
#define DCR_POS                                        (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE1_LOC4 Register */

#define DEV_DYNAMIC_ADDR_LOC4_MASK                     (0xFF << 0) /* Device Dynamic Address assigned. */
#define DEV_DYNAMIC_ADDR_LOC4_POS                      (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE2_LOC1 Register */

#define LSB_PROVISIONAL_ID_MASK                        (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define LSB_PROVISIONAL_ID_POS                         (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE2_LOC2 Register */

#define MSB_PROVISIONAL_ID_MASK                        (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define MSB_PROVISIONAL_ID_POS                         (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE2_LOC3 Register */

#define BCR_MASK                                       (0xFF << 8) /* Bus Characteristic Value */
#define BCR_POS                                        (8) /* Bus Characteristic Value */
#define DCR_MASK                                       (0xFF << 0) /* Device Characteristic Value */
#define DCR_POS                                        (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE2_LOC4 Register */

#define DEV_DYNAMIC_ADDR_LOC4_MASK                     (0xFF << 0) /* Device Dynamic Address assigned. */
#define DEV_DYNAMIC_ADDR_LOC4_POS                      (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE3_LOC1 Register */

#define LSB_PROVISIONAL_ID_MASK                        (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define LSB_PROVISIONAL_ID_POS                         (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE3_LOC2 Register */

#define MSB_PROVISIONAL_ID_MASK                        (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define MSB_PROVISIONAL_ID_POS                         (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE3_LOC3 Register */

#define BCR_MASK                                       (0xFF << 8) /* Bus Characteristic Value */
#define BCR_POS                                        (8) /* Bus Characteristic Value */
#define DCR_MASK                                       (0xFF << 0) /* Device Characteristic Value */
#define DCR_POS                                        (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE3_LOC4 Register */

#define DEV_DYNAMIC_ADDR_LOC4_MASK                     (0xFF << 0) /* Device Dynamic Address assigned. */
#define DEV_DYNAMIC_ADDR_LOC4_POS                      (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE4_LOC1 Register */

#define LSB_PROVISIONAL_ID_MASK                        (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define LSB_PROVISIONAL_ID_POS                         (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE4_LOC2 Register */

#define MSB_PROVISIONAL_ID_MASK                        (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define MSB_PROVISIONAL_ID_POS                         (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE4_LOC3 Register */

#define BCR_MASK                                       (0xFF << 8) /* Bus Characteristic Value */
#define BCR_POS                                        (8) /* Bus Characteristic Value */
#define DCR_MASK                                       (0xFF << 0) /* Device Characteristic Value */
#define DCR_POS                                        (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE4_LOC4 Register */

#define DEV_DYNAMIC_ADDR_LOC4_MASK                     (0xFF << 0) /* Device Dynamic Address assigned. */
#define DEV_DYNAMIC_ADDR_LOC4_POS                      (0) /* Device Dynamic Address assigned. */

