AlmAck/svdtonuttx/demo/h/da1470_i3c.h
/* I3C_DEV_CHAR_TABLE5_LOC1 Register */

#define LSB_PROVISIONAL_ID_MASK                        (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define LSB_PROVISIONAL_ID_POS                         (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE5_LOC2 Register */

#define MSB_PROVISIONAL_ID_MASK                        (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define MSB_PROVISIONAL_ID_POS                         (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE5_LOC3 Register */

#define BCR_MASK                                       (0xFF << 8) /* Bus Characteristic Value */
#define BCR_POS                                        (8) /* Bus Characteristic Value */
#define DCR_MASK                                       (0xFF << 0) /* Device Characteristic Value */
#define DCR_POS                                        (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE5_LOC4 Register */

#define DEV_DYNAMIC_ADDR_LOC4_MASK                     (0xFF << 0) /* Device Dynamic Address assigned. */
#define DEV_DYNAMIC_ADDR_LOC4_POS                      (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE6_LOC1 Register */

#define LSB_PROVISIONAL_ID_MASK                        (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define LSB_PROVISIONAL_ID_POS                         (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE6_LOC2 Register */

#define MSB_PROVISIONAL_ID_MASK                        (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define MSB_PROVISIONAL_ID_POS                         (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE6_LOC3 Register */

#define BCR_MASK                                       (0xFF << 8) /* Bus Characteristic Value */
#define BCR_POS                                        (8) /* Bus Characteristic Value */
#define DCR_MASK                                       (0xFF << 0) /* Device Characteristic Value */
#define DCR_POS                                        (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE6_LOC4 Register */

#define DEV_DYNAMIC_ADDR_LOC4_MASK                     (0xFF << 0) /* Device Dynamic Address assigned. */
#define DEV_DYNAMIC_ADDR_LOC4_POS                      (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE7_LOC1 Register */

#define LSB_PROVISIONAL_ID_MASK                        (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define LSB_PROVISIONAL_ID_POS                         (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE7_LOC2 Register */

#define MSB_PROVISIONAL_ID_MASK                        (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define MSB_PROVISIONAL_ID_POS                         (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE7_LOC3 Register */

#define BCR_MASK                                       (0xFF << 8) /* Bus Characteristic Value */
#define BCR_POS                                        (8) /* Bus Characteristic Value */
#define DCR_MASK                                       (0xFF << 0) /* Device Characteristic Value */
#define DCR_POS                                        (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE7_LOC4 Register */

#define DEV_DYNAMIC_ADDR_LOC4_MASK                     (0xFF << 0) /* Device Dynamic Address assigned. */
#define DEV_DYNAMIC_ADDR_LOC4_POS                      (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE8_LOC1 Register */

#define LSB_PROVISIONAL_ID_MASK                        (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define LSB_PROVISIONAL_ID_POS                         (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE8_LOC2 Register */

#define MSB_PROVISIONAL_ID_MASK                        (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define MSB_PROVISIONAL_ID_POS                         (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE8_LOC3 Register */

#define BCR_MASK                                       (0xFF << 8) /* Bus Characteristic Value */
#define BCR_POS                                        (8) /* Bus Characteristic Value */
#define DCR_MASK                                       (0xFF << 0) /* Device Characteristic Value */
#define DCR_POS                                        (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE8_LOC4 Register */

#define DEV_DYNAMIC_ADDR_LOC4_MASK                     (0xFF << 0) /* Device Dynamic Address assigned. */
#define DEV_DYNAMIC_ADDR_LOC4_POS                      (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE_POINTER Register */

#define PRESENT_DEV_CHAR_TABLE_INDX_MASK               (0x7 << 19) /* Current index of Device Characteristics Table.  This field returns the current l */
#define PRESENT_DEV_CHAR_TABLE_INDX_POS                (19) /* Current index of Device Characteristics Table.  This field returns the current l */
#define DEV_CHAR_TABLE_DEPTH_MASK                      (0x7F << 12) /* Depth of Device Characteristics Table */
#define DEV_CHAR_TABLE_DEPTH_POS                       (12) /* Depth of Device Characteristics Table */
#define P_DEV_CHAR_TABLE_START_ADDR_MASK               (0xFFF << 0) /* Start Address of Device Characteristics Table. */
#define P_DEV_CHAR_TABLE_START_ADDR_POS                (0) /* Start Address of Device Characteristics Table. */

/* I3C_HW_CAPABILITY Register */

#define SLV_IBI_CAP                                    (1U << 19) /* Reflects the IC_SLV_IBI Configurable Parameter.  Specifies slave's capability to */
#define SLV_HJ_CAP                                     (1U << 18) /* Reflects the IC_SLV_HJ Configurable Parameter.  Specifies slave's capability to  */
#define DMA_EN                                         (1U << 17) /* Reflects the IC_HAS_DMA Configurable Parameter.  Specifies whether controller is */
#define HDR_TX_CLOCK_PERIOD_MASK                       (0x3F << 11) /* Reflects the IC_HDR_TX_CLK_PERIOD Configurable Parameter. */
#define HDR_TX_CLOCK_PERIOD_POS                        (11) /* Reflects the IC_HDR_TX_CLK_PERIOD Configurable Parameter. */
#define CLOCK_PERIOD_MASK                              (0x3F << 5) /* Reflects the IC_CLK_PERIOD Configurable Parameter */
#define CLOCK_PERIOD_POS                               (5) /* Reflects the IC_CLK_PERIOD Configurable Parameter */
#define HDR_TS_EN                                      (1U << 4) /* Reflects the IC_SPEED_HDR_TS Configurable Parameter.  Specifies the Controllers  */
#define HDR_DDR_EN                                     (1U << 3) /* Reflects the IC_SPEED_HDR_DDR Configurable Parameter.  Specifies the Controllers */
#define DEVICE_ROLE_CONFIG_MASK                        (0x7 << 0) /* Reflects the IC_DEVICE_ROLE Configurable Parameter.  Specifies the configured ro */
#define DEVICE_ROLE_CONFIG_POS                         (0) /* Reflects the IC_DEVICE_ROLE Configurable Parameter.  Specifies the configured ro */

