AlmAck/svdtonuttx/demo/h/da1470_i3c.h
/* I3C_IBI_QUEUE_CTRL Register */

#define NOTIFY_SIR_REJECTED                            (1U << 3) /* Notify Rejected Slave Interrupt Request Control.  This bit is used to suppress r */
#define NOTIFY_HJ_REJECTED                             (1U << 0) /* Notify Rejected Hot-Join Control.  This bit is used to suppress reporting to the */

/* I3C_IBI_QUEUE_STATUS_DATA Register */

#define IBI_STS_MASK                                   (0xF << 28) /* IBI Received Status.  Defines the master response for IBI received.  4'b0xxx: Re */
#define IBI_STS_POS                                    (28) /* IBI Received Status.  Defines the master response for IBI received.  4'b0xxx: Re */
#define IBI_ID_MASK                                    (0xFF << 8) /* IBI Identifier.  The byte received after START which includes the address and th */
#define IBI_ID_POS                                     (8) /* IBI Identifier.  The byte received after START which includes the address and th */
#define DATA_LENGTH_MASK                               (0xFF << 0) /* In-Band Interrupt data length.  This field represents the length of data receive */
#define DATA_LENGTH_POS                                (0) /* In-Band Interrupt data length.  This field represents the length of data receive */

/* I3C_IBI_SIR_REQ_REJECT Register */

#define SIR_REQ_REJECT_MASK                            (0xFFFFFFFF << 0) /* In-band Slave Interrupt Request Reject.  The application of the DWC_mipi_i3c can */
#define SIR_REQ_REJECT_POS                             (0) /* In-band Slave Interrupt Request Reject.  The application of the DWC_mipi_i3c can */

/* I3C_INTR_FORCE Register */

#define TRANSFER_ERR_FORCE_EN                          (1U << 9) /* Transfer Error Force Enable */
#define TRANSFER_ABORT_FORCE_EN                        (1U << 5) /* Transfer Abort Force Enable.  This field is used only in master mode of operatio */
#define RESP_READY_FORCE_EN                            (1U << 4) /* Response Queue Ready Force Enable */
#define CMD_QUEUE_READY_FORCE_EN                       (1U << 3) /* Command Queue Ready Force Enable */
#define IBI_THLD_FORCE_EN                              (1U << 2) /* IBI Buffer Threshold Force Enable.  This field is used only in master mode of op */
#define RX_THLD_FORCE_EN                               (1U << 1) /* Receive Buffer Threshold Force Enable */
#define TX_THLD_FORCE_EN                               (1U << 0) /* Transmit Buffer Threshold Force Enable. */

/* I3C_INTR_SIGNAL_EN Register */

#define TRANSFER_ERR_SIGNAL_EN                         (1U << 9) /* Transfer Error Signal Enable */
#define TRANSFER_ABORT_SIGNAL_EN                       (1U << 5) /* Transfer Abort Signal Enable.  This field is used only in master mode of operati */
#define RESP_READY_SIGNAL_EN                           (1U << 4) /* Response Queue Ready Signal Enable */
#define CMD_QUEUE_READY_SIGNAL_EN                      (1U << 3) /* Command Queue Ready Signal Enable */
#define IBI_THLD_SIGNAL_EN                             (1U << 2) /* IBI Buffer Threshold Signal Enable.  This field is used only in master mode of o */
#define RX_THLD_SIGNAL_EN                              (1U << 1) /* Receive Buffer Threshold Signal Enable */
#define TX_THLD_SIGNAL_EN                              (1U << 0) /* Transmit Buffer Threshold Signal Enable.  *Note: For the deassertion of the inte */

/* I3C_INTR_STATUS_EN Register */

#define TRANSFER_ERR_STS_EN                            (1U << 9) /* Transfer Error Status Enable */
#define TRANSFER_ABORT_STS_EN                          (1U << 5) /* Transfer Abort Status Enable.  This field is used only in master mode of operati */
#define RESP_READY_STS_EN                              (1U << 4) /* Response Queue Ready Status Enable */
#define CMD_QUEUE_READY_STS_EN                         (1U << 3) /* Command Queue Ready Status Enable */
#define IBI_THLD_STS_EN                                (1U << 2) /* IBI Buffer Threshold Status Enable.  This field is used only in master mode of o */
#define RX_THLD_STS_EN                                 (1U << 1) /* Receive Buffer Threshold Status Enable */
#define TX_THLD_STS_EN                                 (1U << 0) /* Transmit Buffer Threshold Status Enable */

/* I3C_INTR_STATUS Register */

#define TRANSFER_ERR_STS                               (1U << 9) /* Transfer Error Status.  This interrupt is generated if any error occurs during t */
#define TRANSFER_ABORT_STS                             (1U << 5) /* Transfer Abort Status.  This field is used only in master mode of operation.  Th */
#define RESP_READY_STS                                 (1U << 4) /* Response Queue Ready Status.  This interrupt is generated when number of entries */
#define CMD_QUEUE_READY_STS                            (1U << 3) /* Command Queue Ready.  This interrupt is generated when number of empty locations */
#define IBI_THLD_STS                                   (1U << 2) /* IBI Buffer Threshold Status.  This field is only used in master mode of operatio */
#define RX_THLD_STS                                    (1U << 1) /* Receive Buffer Threshold Status.  This interrupt is generated when number of ent */
#define TX_THLD_STS                                    (1U << 0) /* Transmit Buffer Threshold Status.  This interrupt is generated when number of em */

/* I3C_PRESENT_STATE Register */

#define MASTER_IDLE                                    (1U << 28) /* This field reflects whether the Master Controller is in Idle state or not. This  */
#define CMD_TID_MASK                                   (0xF << 24) /* This field reflects the Transaction-ID of the current executing command. */
#define CMD_TID_POS                                    (24) /* This field reflects the Transaction-ID of the current executing command. */
#define CM_TFR_ST_STS_MASK                             (0x3F << 16) /* Current Master Transfer State Status.  Indicates the state of current transfer c */
#define CM_TFR_ST_STS_POS                              (16) /* Current Master Transfer State Status.  Indicates the state of current transfer c */
#define CM_TFR_STS_MASK                                (0x3F << 8) /* Transfer Type Status.  Indicates the type of transfer currently executing by the */
#define CM_TFR_STS_POS                                 (8) /* Transfer Type Status.  Indicates the type of transfer currently executing by the */
#define CURRENT_MASTER                                 (1U << 2) /* This Bit is used to check whether the Master is Current Master or not. The Curre */
#define SDA_LINE_SIGNAL_LEVEL                          (1U << 1) /* This bit is used to check the SDA line level to recover from errors and for debu */
#define SCL_LINE_SIGNAL_LEVEL                          (1U << 0) /* This bit is used to check the SCL line level to recover from errors and for debu */

/* I3C_QUEUE_SIZE_CAPABILITY Register */

#define IBI_BUF_SIZE_MASK                              (0xF << 16) /* IBI Queue Size  This field reflects the configured IBI Queue size (in DWORDS) in */
#define IBI_BUF_SIZE_POS                               (16) /* IBI Queue Size  This field reflects the configured IBI Queue size (in DWORDS) in */
#define RESP_BUF_SIZE_MASK                             (0xF << 12) /* Response Queue Size  This field reflects the configured Response Queue size (in  */
#define RESP_BUF_SIZE_POS                              (12) /* Response Queue Size  This field reflects the configured Response Queue size (in  */
#define CMD_BUF_SIZE_MASK                              (0xF << 8) /* Command Queue Size  This field reflects the configured Command Queue size (in DW */
#define CMD_BUF_SIZE_POS                               (8) /* Command Queue Size  This field reflects the configured Command Queue size (in DW */
#define RX_BUF_SIZE_MASK                               (0xF << 4) /* Receive Data Buffer Size  This field reflects the configured Receive Buffer size */
#define RX_BUF_SIZE_POS                                (4) /* Receive Data Buffer Size  This field reflects the configured Receive Buffer size */
#define TX_BUF_SIZE_MASK                               (0xF << 0) /* Transmit Data Buffer Size  This field reflects the configured Transmit Buffer si */
#define TX_BUF_SIZE_POS                                (0) /* Transmit Data Buffer Size  This field reflects the configured Transmit Buffer si */

/* I3C_QUEUE_STATUS_LEVEL Register */

#define IBI_STS_CNT_MASK                               (0x1F << 24) /* IBI Buffer Status Count.  Contains the number of IBI status entries in the IBI B */
#define IBI_STS_CNT_POS                                (24) /* IBI Buffer Status Count.  Contains the number of IBI status entries in the IBI B */
#define IBI_BUF_BLR_MASK                               (0xFF << 16) /* IBI Buffer Level Value.  Contains the number of valid entries in the IBI Buffer. */
#define IBI_BUF_BLR_POS                                (16) /* IBI Buffer Level Value.  Contains the number of valid entries in the IBI Buffer. */
#define RESP_BUF_BLR_MASK                              (0xFF << 8) /* Response Buffer Level Value.  Contains the number of valid data entries in the r */
#define RESP_BUF_BLR_POS                               (8) /* Response Buffer Level Value.  Contains the number of valid data entries in the r */
#define CMD_QUEUE_EMPTY_LOC_MASK                       (0xFF << 0) /* Command Queue Empty Locations.  Contains the number of empty locations in the co */
#define CMD_QUEUE_EMPTY_LOC_POS                        (0) /* Command Queue Empty Locations.  Contains the number of empty locations in the co */

