AlmAck/svdtonuttx/demo/h/da1470_i3c.h
/* I3C_QUEUE_THLD_CTRL Register */

#define IBI_STATUS_THLD_MASK                           (0xFF << 24) /* In-Band Interrupt Status Threshold Value.  Every In Band Interrupt received (wit */
#define IBI_STATUS_THLD_POS                            (24) /* In-Band Interrupt Status Threshold Value.  Every In Band Interrupt received (wit */
#define RESP_BUF_THLD_MASK                             (0xFF << 8) /* Response Buffer Threshold Value.  Controls the number of entries (or greater) in */
#define RESP_BUF_THLD_POS                              (8) /* Response Buffer Threshold Value.  Controls the number of entries (or greater) in */
#define CMD_EMPTY_BUF_THLD_MASK                        (0xFF << 0) /* Command Buffer Empty Threshold Value. Controls the number of empty locations (or */
#define CMD_EMPTY_BUF_THLD_POS                         (0) /* Command Buffer Empty Threshold Value. Controls the number of empty locations (or */

/* I3C_RESET_CTRL Register */

#define IBI_QUEUE_RST                                  (1U << 5) /* IBI Queue Software Reset.  This bit is only used in master mode of operation.  W */
#define RX_FIFO_RST                                    (1U << 4) /* Receive Buffer Software Reset.  Write 1'b1 to this bit to exercise Receive Buffe */
#define TX_FIFO_RST                                    (1U << 3) /* Transmit Buffer Software Reset.  Write 1'b1 to this bit to exercise Transmit Buf */
#define RESP_QUEUE_RST                                 (1U << 2) /* Response Queue Software Reset.  Write 1'b1 to this bit to exercise Response Queu */
#define CMD_QUEUE_RST                                  (1U << 1) /* Command Queue Software Reset.  Write 1'b1 to this bit to exercise Command Queue  */
#define SOFT_RST                                       (1U << 0) /* Core Software Reset.  Write 1'b1 to this bit to exercise software reset. This wi */

/* I3C_RESPONSE_QUEUE_PORT Register */

#define RESPONSE_MASK                                  (0xFFFFFFFF << 0) /* 32 bit Response */
#define RESPONSE_POS                                   (0) /* 32 bit Response */

/* I3C_RX_TX_DATA_PORT Register */

#define RX_TX_DATA_PORT_MASK                           (0xFFFFFFFF << 0) /* Receive and Transmit Data Port. (Merged in Doxbox)  The Receive data port is map */
#define RX_TX_DATA_PORT_POS                            (0) /* Receive and Transmit Data Port. (Merged in Doxbox)  The Receive data port is map */

/* I3C_SCL_EXT_LCNT_TIMING Register */

#define I3C_EXT_LCNT_4_MASK                            (0xFF << 24) /* I3C Extended Low Count Register 4  SDR4 uses this register field for data transf */
#define I3C_EXT_LCNT_4_POS                             (24) /* I3C Extended Low Count Register 4  SDR4 uses this register field for data transf */
#define I3C_EXT_LCNT_3_MASK                            (0xFF << 16) /* I3C Extended Low Count Register 3  SDR3 uses this register field for data transf */
#define I3C_EXT_LCNT_3_POS                             (16) /* I3C Extended Low Count Register 3  SDR3 uses this register field for data transf */
#define I3C_EXT_LCNT_2_MASK                            (0xFF << 8) /* I3C Extended Low Count Register 2  SDR2 uses this register field for data transf */
#define I3C_EXT_LCNT_2_POS                             (8) /* I3C Extended Low Count Register 2  SDR2 uses this register field for data transf */
#define I3C_EXT_LCNT_1_MASK                            (0xFF << 0) /* I3C Extended Low Count Register 1  SDR1 uses this register field for data transf */
#define I3C_EXT_LCNT_1_POS                             (0) /* I3C Extended Low Count Register 1  SDR1 uses this register field for data transf */

/* I3C_SCL_EXT_TERMN_LCNT_TIME Register */

#define I3C_EXT_TERMN_LCNT_MASK                        (0xF << 0) /* I3C Read Termination Bit Low count.  Extended I3C Read Termination Bit low count */
#define I3C_EXT_TERMN_LCNT_POS                         (0) /* I3C Read Termination Bit Low count.  Extended I3C Read Termination Bit low count */

/* I3C_SCL_I2C_FMP_TIMING Register */

#define I2C_FMP_HCNT_MASK                              (0xFF << 16) /* I2C Fast Mode Plus High Count  The SCL open-drain high count timing for I2C fast */
#define I2C_FMP_HCNT_POS                               (16) /* I2C Fast Mode Plus High Count  The SCL open-drain high count timing for I2C fast */
#define I2C_FMP_LCNT_MASK                              (0xFFFF << 0) /* I2C Fast Mode Plus Low Count  The SCL open-drain low count timing for I2C fast m */
#define I2C_FMP_LCNT_POS                               (0) /* I2C Fast Mode Plus Low Count  The SCL open-drain low count timing for I2C fast m */

/* I3C_SCL_I2C_FM_TIMING Register */

#define I2C_FM_HCNT_MASK                               (0xFFFF << 16) /* I2C Fast Mode High Count  The SCL open-drain high count timing for I2C fast mode */
#define I2C_FM_HCNT_POS                                (16) /* I2C Fast Mode High Count  The SCL open-drain high count timing for I2C fast mode */
#define I2C_FM_LCNT_MASK                               (0xFFFF << 0) /* I2C Fast Mode Low Count  The SCL open-drain low count timing for I2C fast mode t */
#define I2C_FM_LCNT_POS                                (0) /* I2C Fast Mode Low Count  The SCL open-drain low count timing for I2C fast mode t */

/* I3C_SCL_I3C_OD_TIMING Register */

#define I3C_OD_HCNT_MASK                               (0xFF << 16) /* I3C Open Drain High Count.  SCL open-drain High count (I3C) for I3C transfers ta */
#define I3C_OD_HCNT_POS                                (16) /* I3C Open Drain High Count.  SCL open-drain High count (I3C) for I3C transfers ta */
#define I3C_OD_LCNT_MASK                               (0xFF << 0) /* I3C Open Drain Low Count.  SCL Open-drain low count for I3C transfers targeted t */
#define I3C_OD_LCNT_POS                                (0) /* I3C Open Drain Low Count.  SCL Open-drain low count for I3C transfers targeted t */

/* I3C_SCL_I3C_PP_TIMING Register */

#define I3C_PP_HCNT_MASK                               (0xFF << 16) /* I3C Push Pull High Count.  SCL push-pull High count for I3C transfers targeted t */
#define I3C_PP_HCNT_POS                                (16) /* I3C Push Pull High Count.  SCL push-pull High count for I3C transfers targeted t */
#define I3C_PP_LCNT_MASK                               (0xFF << 0) /* I3C Push Pull Low Count.  SCL Push-pull low count for I3C transfers targeted to  */
#define I3C_PP_LCNT_POS                                (0) /* I3C Push Pull Low Count.  SCL Push-pull low count for I3C transfers targeted to  */

/* I3C_SDA_HOLD_DLY_TIMING Register */

#define SDA_TX_HOLD_MASK                               (0x7 << 16) /* This field controls the hold time (in term of the core clock period) of the tran */
#define SDA_TX_HOLD_POS                                (16) /* This field controls the hold time (in term of the core clock period) of the tran */

/* I3C_SLV_EVENT_STATUS Register */

