AlmAck/svdtonuttx/demo/h/da1470_i3c.h
#define MWL_UPDATED                                    (1U << 7) /* MWL Updated Status.  This bit indicates a SETMWL CCC is received by the slave. T */
#define MRL_UPDATED                                    (1U << 6) /* MRL Updated Status.  This bit indicates a SETMRL CCC is received by the slave. T */
#define ACTIVITY_STATE_MASK                            (0x3 << 4) /* Activity State Status.  ENTAS0 - 00  ENTAS1 - 01  ENTAS2 - 10  ENTAS3 - 11  This */
#define ACTIVITY_STATE_POS                             (4) /* Activity State Status.  ENTAS0 - 00  ENTAS1 - 01  ENTAS2 - 10  ENTAS3 - 11  This */

/* I3C_VENDOR_SPECIFIC_PTR Register */

#define P_VENDOR_REG_START_ADDR_MASK                   (0xFFFF << 0) /* Start Address of Vendor specific registers. */
#define P_VENDOR_REG_START_ADDR_POS                    (0) /* Start Address of Vendor specific registers. */

/* I3C_VER_ID Register */

#define I3C_VER_ID_MASK                                (0xFFFFFFFF << 0) /* Current release type  This field indicates the Synopsys DesignWare Cores DWC_mip */
#define I3C_VER_ID_POS                                 (0) /* Current release type  This field indicates the Synopsys DesignWare Cores DWC_mip */

/* I3C_VER_TYPE Register */

#define I3C_VER_TYPE_MASK                              (0xFFFFFFFF << 0) /* Current release type  This field indicates the Synopsys DesignWare Cores DWC_mip */
#define I3C_VER_TYPE_POS                               (0) /* Current release type  This field indicates the Synopsys DesignWare Cores DWC_mip */

#endif /* __DA1470_I3C_H */
